import streamlit as st
import pandas as pd

def material_today():

    st.title("10月16日資料")

    with st.container(border=True):
        st.write("""
                1.論文の内容紹介  
                1-1.提案手法のイメージ  
                1-2.提案手法の詳細な手順  
                1-3.選択  
                1-4.突然変異  
                2.交叉手法の疑似コード  
                3.今後の予定  
                4.参考文献  
                """)

    section = st.sidebar.radio("章選択", ["1", "2", "3", "4"])
    if section == "1":
        section1()
    if section == "2":
        section2()
    if section == "3":
        section3()
    if section == "4":
        section4()

def section1():
    st.subheader("1.論文の内容紹介")

    st.write("""
                今回は、参考文献[1]の論文がベースの内容になっている。  
                シュタイナー木問題に対するGAの交叉手法が提案された論文である。  
                まず、この提案手法を紹介する。
            """)

    st.subheader("1-1.提案手法のイメージ")

    st.write("""
                まず、この手法には、  
                ・個体がシュタイナー木であることは担保される。  
                ・個体は、根付き木として管理する。  
                ・評価値は0以上の値を取り、高い方が良い。  
                という特徴があるので、これらに注意してほしい。
            """)
    st.write("""
            そのうえで簡単に流れを追うと、以下のようになる。  
            """)
    with st.container(border = True):
        st.write("""
                :red[1.]親個体T1,T2の論理積を取った、newTを用意。  
                :red[2.]newTが「サイクルを含まない」かつ「連結」になるまで、T1,T2上のパスをnewTに加えていく。
                """)
    st.write(""" 
            ここで親個体二つはシュタイナー木だから、論理積をとったnewTは少なくともターミナルを全て含む。つまり、ii)の条件さえ満たせば、newTはシュタイナー木になれる。  
            """)
    st.write("""
            また、交叉中に使用する評価値fitnessを求める関数については、fitnessが負にならない程度に十分大きな定数Aに対し、  
            fitness = Aー(含まれる辺の重みの和)  
            """)

    st.divider()

    st.subheader("1-2.提案手法の詳細な手順")

    st.write("""
            次に、細かく流れを追う。ところどころ意味不明だと思う(例えば手順6の「ルール」)が、後で説明することにして、ひとまず流れだけ書く。
            """)
    with st.container(border = True):
        st.write("""
                :red[0.]T1,T2の葉の情報が入った列leaf1,leaf2を用意する。  
                :red[1.]T1,T2の論理積を取ったnewTを作る。  
                :red[2.]leaf1,leaf2両方に含まれる頂点から、ランダムに一つ選びvとする。vをleaf1,leaf2から取り除く。  
                :red[3.]T1上でvから、最初にnewTと合流する頂点まで親をたどり、たどった時に通ったパスをP1とする。T2に対しても同様にし、パスをP2とする。  
                :red[4.]もしP1,P2両方に含まれる点がv以外にあるなら、その点をuとし、P1,P2をそれぞれT1,T2上でのuvパスにする。leaf1,leaf2にuを加える。  
                :red[5.]newTとP1の論理和に対応するグラフにサイクルがあったら、P1の評価値を0にする。P2にも同様の操作をする。  
                :red[5'.]P1,P2どちらも評価値が0なら、子個体を生成せず交叉処理を終了する。  
                :red[6.]P1とP2を比較し、評価値が高い方をnewTに加える。T1,T2から、冗長な点と辺をルールにのっとり削除する。  
                :red[7.]leaf1,leaf2両方に含まれる頂点が残っていれば、2.に戻る。  
                :red[8.]T1かT2が空集合になったら、10.に進む。  
                :red[9.]newTとT1の論理和にサイクルがあったら、T1の評価値を0にする。T2にも同様の操作をする。  
                :red[9'.]T1,T2どちらも評価値が0なら、子個体を生成せず交叉処理を終了する。
                :red[10.]T1とT2を比較し、評価値が高い方をnewTに加える。
                :red[11.]newTを子個体として返し、交叉処理を終了する。  
                """)

    st.write("""
            :red[・0.]  
            下準備フェーズ。今後、leaf1,leaf2どちらにも入っている頂点を起点に操作を行っていく。
            """)

    st.write("""
            :red[・1.]  
            論理積を取る。この段階では大抵連結でないが、先述の通りターミナルは全て含んでる。
            """)
    
    st.write("""
            :red[・2.]  
            T1,T2どちらでも葉となっている点vを選んでくる。これにより、同じ頂点から二通りのパスを伸ばせる。
            """)

    st.write("""
            :red[・3.]  
            vから根に向けて、T1上をたどっていく。newTにも含まれている頂点μにたどり着いたら、たどるのをやめて、vからμへのパスをP1とする。T2にも同様にし、P2とする。  
            これをすると、P1(またはP2)をnewTへ加えた時にうれしいことが起こる。  
            vはT1,T2両方に含まれるため、当然newTにも含まれる。またμもnewTに含まれるため、vμパスをnewTに加えれば、newTの連結成分が一つ減り、連結へ一歩近づくことができる。
            """)
    
    st.write("""
            :red[・4.]  
            v以外の点でP1,P2両方に含まれる点がある、つまりP1,P2が途中で合流している場合、vから見て最初に合流した点uから先のパスは一旦考えないことにし、P1,P2をvuパスにしてしまう。  
            またuをleaf1,leaf2に加えておくことで、uから先のパスが後で操作対象に選ばれるようにしている。
            """)

    st.write("""
            :red[・5.]
            パスを加えた時にサイクルがあるとまずいので、サイクルができてしまうパスは評価値を0にして加わらないようにする。  
            P1,P2ともに評価値が0になってしまったときは、詰みなので子個体を生成せず交叉処理を終了する。
            """)

    st.write("""
            :red[・6.]
            P1,P2を比較し、評価値が高い方(辺の重みの和が小さい方)をnewTにそのまま加える。T1,T2から、冗長な点と辺をルールにのっとり削除する。ルールは以下の通り。  
            """)
    
    with st.container(border = True):
        st.write("""
                P1がnewTに加わった方のパスとする。  
                :red[a.]P1をT1からまるごと削除する。  
                :red[b.]P2については、以下のようにする。  
                :blue[i)]vが「ターミナルでなく、かつ子を持たない」なら、vを削除する。そうでないなら操作を終了する。  
                :blue[ii)]vの親をvと置きなおし、i)に戻る。  
                """)

    st.caption("今まで使ってきた、要らない枝を削除する方法と同じことをしている。")

    st.write("""
            :red[・7.]
            leaf1,leaf2の両方に含まれる辺がなくなるまで、2～6を繰り返す。  
            """)

    st.write("""
            :red[・8.]
            6.での削除操作により、T1,T2は徐々に小さくなっていく。もしどちらかが空集合になったら、11.へ、つまり操作終了。
            """)

    st.write("""
            :red[・9.]
            T1,T2どちらでも葉である点がなくなったうえで、まだどちらも空集合になっていない時はここに来る。  
            T1をnewTに加えた時にサイクルができるなら、T1の評価値を0にする。T2も同様にする。  
            T1,T2ともに評価値が0になってしまったときは、詰みなので子個体を生成せず交叉処理を終了する。  
            """)

    st.write("""
            :red[・10.]
            T1,T2を比較し、評価値が高い方(辺の重みの和が小さい方)をnewTにそのまま加える。
            """)

    st.write("""
            :red[・11.]
            newTを出力し、交叉処理を終了する。
            """)

    st.subheader("1-3.選択")

    st.write("""
            これまでやってきた手法では、トーナメントランキング選択を使ってきた。  
            一方論文中では、トーナメントルーレット選択(この資料で勝手に呼んでるだけ)を行っている。  
            まず5個体ランダムに選び、その5個体中でルーレット選択をするものになっている。  
            """)

    st.subheader("1-4.突然変異")
    st.write("""
            これまでやってきた手法は、木の中から2点選んでパスをつなぐというものだった。  
            一方論文中では、頂点集合の部分集合を選んできて、それらの頂点と、そこからつながっている辺をすべて削除。  
            非連結になるので、連結成分同士を最短経路を選びながら結んで、連結になるよう補正処理を行うという方法を取っていた。
            """)
    

def section2():
    st.subheader("2.交叉手法の疑似コード")
    st.write("一旦疑似コードを書いてみた。前章で紹介した手順の流れに沿って書いている。")

    with open('materials/_fifth/code/crossover_pseudocode.txt','r',encoding='utf-8') as file:
        code = file.read()
    st.code(code)

    st.write("これを基に実装中。")

def section3():
    st.subheader("3.今後の予定")
    st.write("""
            - とりあえず実装。  
            - 実装終わり次第実験。  
            - 実験まわしながらスライド作りたい。  
            - 突然変異とかの、交叉手法以外の部分も論文のものに合わせた方がいいでしょうか？
            """)

def section4():
    st.subheader("4.参考文献")
    st.write("[1] Qiongbing Zhang et al. A New Crossover Mechanism for Genetic Algorithms for Steiner Tree Optimization IEEE Transactions on Cybernetics. 2022, Volume 52, pp. 3147-3158.")
    st.write("https://ieeexplore.ieee.org/abstract/document/9153917")